Revit 2024 API
BuiltInFailures.DimensionFailures.SpotElevationMissesReference Property
 Spot Dimension does not lie on its reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SpotElevationMissesReference { get; }
Visual Basic
Public Shared ReadOnly Property SpotElevationMissesReference As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SpotElevationMissesReference {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace